In [1]:

import numpy as np
import pandas as pd
my_dect = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],

'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],

'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],

"labels": ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']}



df =pd.DataFrame(my_dect)

print(df)

        name  score  attempts qualify labels
0  Anastasia   12.5         1     yes      a
1       Dima    9.0         3      no      b
2  Katherine   16.5         2     yes      c
3      James    NaN         3      no      d
4      Emily    9.0         2      no      e
5    Michael   20.0         3     yes      f
6    Matthew   14.5         1     yes      g
7      Laura    NaN         1      no      h
8      Kevin    8.0         2      no      i
9      Jonas   19.0         1     yes      j

In [2]:
df.head(3)

        name  score  attempts qualify labels
0  Anastasia   12.5         1     yes      a
1       Dima    9.0         3      no      b
2  Katherine   16.5         2     yes      c

In [3]:
df=df.drop( 3 , axis="index")

In [4]:
df=df.drop( 7 , axis="index")

In [5]:
print(df)

        name  score  attempts qualify labels
0  Anastasia   12.5         1     yes      a
1       Dima    9.0         3      no      b
2  Katherine   16.5         2     yes      c
4      Emily    9.0         2      no      e
5    Michael   20.0         3     yes      f
6    Matthew   14.5         1     yes      g
8      Kevin    8.0         2      no      i
9      Jonas   19.0         1     yes      j

In [6]:
df[["name","score"]]

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5
4      Emily    9.0
5    Michael   20.0
6    Matthew   14.5
8      Kevin    8.0
9      Jonas   19.0

In [7]:

my_dect2={"name":["Suresh"], "score": [15.5],"attempts": [1],"qualify": ["yes"],"k":["K"]}
my_data =pd.DataFrame(my_dect2)
my_data = my_data.set_index("k")
new_data =pd.concat([df,my_data])
print(new_data)

        name  score  attempts qualify labels
0  Anastasia   12.5         1     yes      a
1       Dima    9.0         3      no      b
2  Katherine   16.5         2     yes      c
4      Emily    9.0         2      no      e
5    Michael   20.0         3     yes      f
6    Matthew   14.5         1     yes      g
8      Kevin    8.0         2      no      i
9      Jonas   19.0         1     yes      j
K     Suresh   15.5         1     yes    NaN

In [8]:
df.drop('attempts',axis="columns")

        name  score qualify labels
0  Anastasia   12.5     yes      a
1       Dima    9.0      no      b
2  Katherine   16.5     yes      c
4      Emily    9.0      no      e
5    Michael   20.0     yes      f
6    Matthew   14.5     yes      g
8      Kevin    8.0      no      i
9      Jonas   19.0     yes      j

In [18]:
success_list=[]
score_list=df["score"].tolist()
for i in score_list:
    if i >= 10:
        success_list.append(1)
    else:
         success_list.append(0)
            
my_array = np.array(success_list)

In [19]:
df["success"] = my_array.tolist()

In [20]:
print(df)

        name  score  attempts qualify labels  success
0  Anastasia   12.5         1     yes      a        1
1       Dima    9.0         3      no      b        0
2  Katherine   16.5         2     yes      c        1
4      Emily    9.0         2      no      e        0
5    Michael   20.0         3     yes      f        1
6    Matthew   14.5         1     yes      g        1
8      Kevin    8.0         2      no      i        0
9      Jonas   19.0         1     yes      j        1

In [21]:
df.to_csv("something.csv")